[
  {
    "id": "places/ChIJvQmmCSS35YgR-3H9ajzGCHk/reviews/Ci9DQUlRQUNvZENodHljRjlvT25OQlVUaEhabXhEZG1ab1NHUmpTMWMyVGxWVFVGRRAB",
    "author": "Mort Crim",
    "rating": 5,
    "text": "This was the second time I have used Sargent -- first for a seat  leather replacement in my 2008 Mercedes, and this latest time, for a convertible top repair on my 2018 Mercedes.  I both instances, Sargent was on time and on budget.  I rate their service excellent. Friendly staff, and extremely good at what they do. I went to them the first time on the recommendation of a friend.  I'm happy to recommend this firm to my friends.",
    "date": "2026-01-14T20:47:26.303641619Z",
    "relativeTime": "a month ago",
    "googleMapsUri": "https://www.google.com/maps/reviews/data=!4m6!14m5!1m4!2m3!1sCi9DQUlRQUNvZENodHljRjlvT25OQlVUaEhabXhEZG1ab1NHUmpTMWMyVGxWVFVGRRAB!2m1!1s0x88e5b72409a609bd:0x7908c63c6afd71fb"
  },
  {
    "id": "places/ChIJvQmmCSS35YgR-3H9ajzGCHk/reviews/Ci9DQUlRQUNvZENodHljRjlvT2psNFlYZE5Va1ozWm1kUVF6VkhUMVI0VTE5UVdFRRAB",
    "author": "lilli budner",
    "rating": 5,
    "text": "Sargents is the best! The service was so fast and done beautifully, you would never even know. I am so thrilled with my experience, I will always bring any upholstery issues to them, and highly recommend anyone moving forward! My boyfriend is gonna be so happy when he gets home from deployment.\nThank you so much again!!!",
    "date": "2025-12-06T17:57:52.748170133Z",
    "relativeTime": "2 months ago",
    "googleMapsUri": "https://www.google.com/maps/reviews/data=!4m6!14m5!1m4!2m3!1sCi9DQUlRQUNvZENodHljRjlvT2psNFlYZE5Va1ozWm1kUVF6VkhUMVI0VTE5UVdFRRAB!2m1!1s0x88e5b72409a609bd:0x7908c63c6afd71fb"
  },
  {
    "id": "places/ChIJvQmmCSS35YgR-3H9ajzGCHk/reviews/Ci9DQUlRQUNvZENodHljRjlvT21JME9YRmpPV3cyWmtNM2VYZzFlVFZwUTNRM1ZrRRAB",
    "author": "Kent M",
    "rating": 5,
    "text": "Sargents has been around in Jax for almost 80 years and there is a reason why, no one comes close to their expertise at repairing the unfixable. My 20+ yr car's sunroof was so rusted and dilapidated, the glass partition blew off and exposed all of the rotted under parts which I was totally unaware of.  No other companies I called would or could do the job but Sargents said YES we can do it. 😉 When the job was completed at a very reasonable cost, I was shocked how perfect it came out.",
    "date": "2025-10-30T22:26:25.925099252Z",
    "relativeTime": "3 months ago",
    "googleMapsUri": "https://www.google.com/maps/reviews/data=!4m6!14m5!1m4!2m3!1sCi9DQUlRQUNvZENodHljRjlvT21JME9YRmpPV3cyWmtNM2VYZzFlVFZwUTNRM1ZrRRAB!2m1!1s0x88e5b72409a609bd:0x7908c63c6afd71fb"
  },
  {
    "id": "places/ChIJvQmmCSS35YgR-3H9ajzGCHk/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pWRFRsZDJkbkZKT0RkNU5VbGtWMFJ6WVcxbWFHYxAB",
    "author": "Manuel Lopez",
    "rating": 5,
    "text": "Sargent Upholstery absolutely exceeded my expectations. From start to finish, Josh and Mike were friendly, professional, and timely. They kept me updated throughout the process, and the results speak for themselves.\n\nThe front seats were completely transformed the new leather looks stunning, feels soft to the touch, and gives the interior a like-new luxury feel. The craftsmanship is obvious, and it’s clear their decades of experience show in every detail.\n\nOn top of the quality, the pricing was a great value, especially considering the level of skill and care that went into the work. I couldn’t be happier with the outcome, and I can’t recommend Sargent Upholstery enough for anyone looking to restore or upgrade their vehicle’s interior.",
    "date": "2025-10-24T21:40:30.250947140Z",
    "relativeTime": "3 months ago",
    "googleMapsUri": "https://www.google.com/maps/reviews/data=!4m6!14m5!1m4!2m3!1sCi9DQUlRQUNvZENodHljRjlvT2pWRFRsZDJkbkZKT0RkNU5VbGtWMFJ6WVcxbWFHYxAB!2m1!1s0x88e5b72409a609bd:0x7908c63c6afd71fb"
  },
  {
    "id": "places/ChIJvQmmCSS35YgR-3H9ajzGCHk/reviews/Ci9DQUlRQUNvZENodHljRjlvT2paMGNsaFdkbWh4VWxOMFV6QTFNMlYzYVc1bVNWRRAB",
    "author": "Timar Wright",
    "rating": 5,
    "text": "I dropped the Captains chairs to my RV off 2 weeks before my scheduled appointment date so I was not expecting to hear anything for at least 4 weeks. Well, they were completed in less than 2 weeks. The seats look great. They look like new factory seats. They were even able to transfer the \"Discovery LXE\" logo that was in the headrest. Which wasn't something they thought they could replicate. The material is so soft. I am so very pleased with the workmanship that went into the seats. I will be returning to have the rest of the RV furniture done by Sargent as well. Josh, you and the rest of the crew are top knotch. Thank you so much 😊",
    "date": "2025-06-10T18:41:17.500859746Z",
    "relativeTime": "8 months ago",
    "googleMapsUri": "https://www.google.com/maps/reviews/data=!4m6!14m5!1m4!2m3!1sCi9DQUlRQUNvZENodHljRjlvT2paMGNsaFdkbWh4VWxOMFV6QTFNMlYzYVc1bVNWRRAB!2m1!1s0x88e5b72409a609bd:0x7908c63c6afd71fb"
  }
]